[  
  {    
    "id": 1,    
    "title": "Software Engineer",    
    "location": "San Francisco, CA",    
    "description": "We are seeking a talented software engineer to join our team. The successful candidate will have experience in developing high-quality software and a passion for delivering excellent user experiences.",    
    "requirements": [      
        "Bachelor's degree in Computer Science or a related field",      
        "3+ years of experience in software development",      
        "Strong knowledge of JavaScript and React",      
        "Experience with Material-UI a plus",      
        "Excellent communication and teamwork skills" 
    ]
  },
  {
    "id": 2,
    "title": "Product Manager",
    "location": "New York, NY",
    "description": "We are seeking a creative and driven product manager to lead the development of our next generation of products. The ideal candidate will have a proven track record of delivering successful products and a deep understanding of the technology industry.",
    "requirements": [
      "Bachelor's degree in Computer Science, Business, or a related field",
      "5+ years of experience in product management",
      "Strong problem-solving and analytical skills",
      "Excellent leadership and communication skills",
      "Ability to work in a fast-paced and dynamic environment"
    ]
  },
  {
    "id": 3,
    "title": "Frontend Developer",
    "location": "London, UK",
    "description": "We are seeking a frontend developer to join our growing team. The ideal candidate will have experience in developing modern and responsive user interfaces and a passion for delivering excellent user experiences.",
    "requirements": [
      "Bachelor's degree in Computer Science or a related field",
      "2+ years of experience in frontend development",
      "Strong knowledge of JavaScript, HTML, and CSS",
      "Experience with React and Material-UI a plus",
      "Excellent problem-solving and debugging skills"
    ]
  },
  {
    "id": 4,
    "title": "Data Scientist",
    "location": "Berlin, Germany",
    "description": "We are seeking a data scientist to join our team. The ideal candidate will have experience in developing predictive models and a passion for turning data into actionable insights.",
    "requirements": [
      "Master's degree in Computer Science, Mathematics, or a related field",
      "3+ years of experience in data science",
      "Strong knowledge of Python and machine learning libraries",
      "Experience with data visualization tools a plus",
      "Excellent problem-solving and critical thinking skills"
    ]
  },
  {
    "id": 5,
    "title": "UX Designer",
    "location": "Paris, France",
    "description": "We are seeking a talented UX designer to join our team. The ideal candidate will have experience in designing intuitive and user-friendly interfaces and a passion for delivering excellent user experiences.",
    "requirements": [
      "Bachelor's degree in Graphic Design, Human-Computer Interaction, or a related field",
      "3+ years of experience in UX design",
      "Strong knowledge of design tools such as Sketch and Figma",
      "Experience with prototyping tools a plus",
      "Excellent communication and collaboration skills"
    ]
}

]

